# AvailabilityClassName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PushButtonData..::..AvailabilityClassName Property
PushButtonData Class See Also
---
The full class name for the class providing the entry point to decide availability of this push button.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string AvailabilityClassName { get; set; }
```

Visual Basic
---
```text
Public Property AvailabilityClassName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ AvailabilityClassName {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
This is the class implementing IExternalCommandAvailability interface.
# See Also
PushButtonData Class
Autodesk.Revit.UI Namespace